Revit 2027 API
LightGroup.GetLights Method
 Get the set of contained light instances The set of light instances
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetLights()
Public Function GetLights As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetLights()
member GetLights : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
See Also
Reference
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace